Revit 2027 API
BuiltInFailures.ElectricalFailures.AllSlotsOnPanelOccupied Property
 All slots on panel: [Panel Name] are occupied. Some circuits will be disconnected from this panel.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AllSlotsOnPanelOccupied { get; }
Public Shared ReadOnly Property AllSlotsOnPanelOccupied As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AllSlotsOnPanelOccupied {
	FailureDefinitionId^ get ();
}
static member AllSlotsOnPanelOccupied : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace